// 'use strict';  // работаем с стандарте ES6


/*let number = 5;
let string = "Hello!";
let sym = Symbol();
let boolean = true;
null;				//когда в коде просто не существует
undefined;			//переменная существует, но значения не имеет

let obj = {};	*/


// let persone = {
//   name: "John",
//   age: 25,
//   isMarried: false
// };

// console.log(persone.name);      // 1 способ
// console.log(persone["age"]);    // 2 способ


// массив
// let arr = ['plum.png', 'orange.jpg', 'apple.bmp'];



// alert("Hello world!");  // модальное окно

/*let answer = confirm("Are you here?"); // модальное окно сдвумя кнопками*/


// let answer = prompt("Есть ли Вам 18?", "Да");  // в консоле всегда строка
// let answer = +prompt("Есть ли Вам 18?", "Да");  // в консоле с унарным +всегда number

// console.log(answer); 


/*let incr = 10,
    decr = 10;

console.log(incr++);
console.log(decr--);*/

//=========================================================================================
//=========================================================================================
//=========================================================================================
//**********************************условия*************************************** */


/*let num = 50;

if (num < 49) {
  console.log('Неверно!');
} else if (num > 100) {
  console.log('Много!');
} else {
  console.log('Верно!');
};


// тернарный оператор
(num == 50) ? console.log('Верно!') : console.log('Неверно!');


// Конструкция swich

switch (num) {
  case num < 49:
    console.log('Неверно!');
    break;
  case num > 100:
    console.log('Много!');
    break;
  case num > 800:
    console.log('Все еще много!');
    break;
  case 50:                                  // неправильная запись num == 50
    console.log('Верно!');
    break;
  default:
    console.log('Что-то пошло не так!');
    break;
}
*/

//=========================================================================================
//=========================================================================================
//=========================================================================================
//**********************************циклы*************************************** */

//let num = 50;
// while (num < 55) {
//   console.log(num);
//   num++;
// }

// do {
//   console.log(num);
//   num++;
// }
// while (num < 55);

// for (let i = 0; i < 15; i++) {
//   if (i == 7) {
//     continue              // прерывание цикла
//   }
//   if (i == 14) {
//     break                 // выход из цикла
//   }
//   console.log(i);
// }



//=========================================================================================
//=========================================================================================
//=========================================================================================
//**********************************функции*************************************** */


// let num = 20;

// function showFirstMessage(text) {
//   alert(text);
//   let num = 10;
//   console.log(num);
// }

// showFirstMessage('Hello World!');
// console.log(num);

// Замыкания - это функция всместе со всеми внешними переменными, которые ей доступны
// функция возвращает значение при помощи ключевого слова return. Когда функция видит return она прекращает  действия


// function calc(a, b) {
//   return (a + b);
// }

// console.log(calc(4, 8));

// console.log(calc(9, 8));



// function retVar() {
//   let num = 80;
//   return num;
// }

// let anotherNum = retVar();

// console.log(anotherNum);


// function declaration - функция, как и переменная создается до начала кода и их можно вызывать до объявления





// function ecspretion - когда фунцию присваеваем в переменную
// функция создается только тогда, когда код до нее доходит и вызрать ее заранее невозможно

// let calc = function(a, b) {
//   return (a + b);
// };

// console.log(calc(4, 45));


// стрелочная функция
// let calc = (a, b) => a + b;

// console.log(calc(4, 45));


// МЕТОДЫ И СВОЙСТВА У СТРОК И ЧИСЕЛ
// МЕТОДЫ - вспомогательные функции
// СВОЙСТВА - вспомогательные значения

// строки
let str = 'test';
console.log(str.length);

console.log(str.toUpperCase());
console.log(str.toLocaleLowerCase());

// числа
let twelve = "12.22px";
//console.log(Math.round(twelve));  // округление до целого

console.log(parseInt(twelve));      // преобразование и округление до целого
console.log(parseFloat(twelve));    // преобразование в число 






















































