'use strict';  // работаем с стандарте ES6


/*let number = 5;
let string = "Hello!";
let sym = Symbol();
let boolean = true;
null;				//когда в коде просто не существует
undefined;			//переменная существует, но значения не имеет

let obj = {};	*/


// let persone = {
//   name: "John",
//   age: 25,
//   isMarried: false
// };

// console.log(persone.name);      // 1 способ
// console.log(persone["age"]);    // 2 способ


// массив
// let arr = ['plum.png', 'orange.jpg', 'apple.bmp'];



// alert("Hello world!");  // модальное окно

/*let answer = confirm("Are you here?"); // модальное окно сдвумя кнопками*/


// let answer = prompt("Есть ли Вам 18?", "Да");  // в консоле всегда строка
// let answer = +prompt("Есть ли Вам 18?", "Да");  // в консоле с унарным +всегда number

// console.log(answer); 


/*let incr = 10,
    decr = 10;

console.log(incr++);
console.log(decr--);*/

//=========================================================================================
//=========================================================================================
//=========================================================================================
//**********************************условия*************************************** */


/*let num = 50;

if (num < 49) {
  console.log('Неверно!');
} else if (num > 100) {
  console.log('Много!');
} else {
  console.log('Верно!');
};


// тернарный оператор
(num == 50) ? console.log('Верно!') : console.log('Неверно!');


// Конструкция swich

switch (num) {
  case num < 49:
    console.log('Неверно!');
    break;
  case num > 100:
    console.log('Много!');
    break;
  case num > 800:
    console.log('Все еще много!');
    break;
  case 50:                                  // неправильная запись num == 50
    console.log('Верно!');
    break;
  default:
    console.log('Что-то пошло не так!');
    break;
}
*/

//=========================================================================================
//=========================================================================================
//=========================================================================================
//**********************************циклы*************************************** */


































